{"pages":[{"title":"Citrination API Documentation","text":"This page contains documentation for the Citrination API. That API can be accessed using a python client (python-citrination-client) or java client (java-citrination-client). These tools, as well as the Citrination platform, are maintained by Citrine Informatics.","tags":"","url":"index.html"},{"title":"api","text":"The Citrination API provides access to search the data that is stored on the Citrination platform. The following items are needed to connect to the API: The python Citrination client or java Citrination client https:\/\/github.com\/CitrineInformatics\/python-citrination-client or pip install citrination-client https:\/\/github.com\/CitrineInformatics\/java-citrination-client An API key Available on your account page on Citrination","tags":"","url":"api\/index.html"},{"title":"Client","text":"A client is used to maintain a connection to the Citrination platform. Connect to www.citrination.com Java CitrinationClient client = new CitrinationClient.builder() .setApiKey(&quot;YOUR_API_KEY&quot;) .build(); Python client = CitrinationClient('YOUR_API_KEY') Connect to PROJECT.citrination.com Java CitrinationClient client = new CitrinationClient.builder() .setProject(&quot;PROJECT&quot;) .setApiKey(&quot;YOUR_API_KEY&quot;) .build(); Python client = CitrinationClient('YOUR_API_KEY', 'https:\/\/PROJECT.citrination.com')","tags":"","url":"api\/client\/Client.html"},{"title":"search","text":"Search can currently be run against PIF records in the Citrination platform.","tags":"","url":"api\/search\/index.html"},{"title":"pif","text":"The Citrination API is backed by a powerful query language that allows for granular filtering on the data that is stored on Citrination. Individual results are returned in the PIF schema. The query language exactly mirrors the hierarchy of the PIF schema. Users are encouraged to become familiar with that schema before using the query language.","tags":"","url":"api\/search\/pif\/index.html"},{"title":"query","text":"The base object for a query is a PifQuery object.","tags":"","url":"api\/search\/pif\/query\/index.html"},{"title":"chemical","text":"","tags":"","url":"api\/search\/pif\/query\/chemical\/index.html"},{"title":"ChemicalFieldOperation","text":"","tags":"","url":"api\/search\/pif\/query\/chemical\/ChemicalFieldOperation.html"},{"title":"core","text":"The objects in the core package are common across queries.","tags":"","url":"api\/search\/pif\/query\/core\/index.html"},{"title":"FieldOperation","text":"","tags":"","url":"api\/search\/pif\/query\/core\/FieldOperation.html"},{"title":"ReferenceQuery","text":"","tags":"","url":"api\/search\/pif\/query\/core\/ReferenceQuery.html"},{"title":"SystemQuery","text":"Description Fields","tags":"","url":"api\/search\/pif\/query\/core\/SystemQuery.html"},{"title":"PifQuery","text":"Description A PifQuery object contains all information for a single query. Fields Field name Value type Default Description from Integer 0 Index of the first hit that should be returned. Used for pagination. size Integer 100 Total number of hits that should be returned. Used for pagination. Maximum value of 100. returnSystem Boolean True True to return the PIF objects that matched. False omits the PIF objects and returns only their IDs. addLatex Boolean False True to inject Latex formatting into the results where possible. This only applies to a small subset of the fields in the results. scoreRelevance Boolean False True to turn on relevancy so that the best matches appear first. system Array of SystemQuery objects List of queries to execute at the System level. includeDatasets Array of integers Filter on a subset of datasets by their unique ID. excludeDatasets Array of integers Filter out a subset of datasets by their unique ID.","tags":"","url":"api\/search\/pif\/query\/PifQuery.html"},{"title":"result","text":"Search results are returned in a PifSearchResult object.","tags":"","url":"api\/search\/pif\/result\/index.html"},{"title":"PifSearchHit","text":"Description A PifSearchHit object contains information about a single PIF record that was matched. Fields Field name Value type Description id String ID of the record on Citrination. dataset Integer Dataset to which the record belongs. datasetVersion Integer Version of the dataset to which the record belongs. system PIF System The PIF object that was matched. extracted Map of strings to strings Key value map of values that were extracted. See the extractAs field on FieldOperation and ChemicalFieldOperation.","tags":"","url":"api\/search\/pif\/result\/PifSearchHit.html"},{"title":"PifSearchResult","text":"Description A PifSearchResult object contains information about the results of a query. Fields Field name Value type Description took Integer Number of milliseconds that the query took to execute. totalNumHits Integer Total number of hits that matched the query. hits Array of PifSearchHit objects Records that were matched.","tags":"","url":"api\/search\/pif\/result\/PifSearchResult.html"},{"title":"migration","text":"Users of the previous clients that were available for Citrination can use this guide to convert their searches to the newer API syntax. Update client libraries Updates to the python client library are available on github or using pip with pip install citrination-client. Making connections to Citrination using the Python client See the Client page. Search queries The previous python client used the following fields to define a search: term - General search string. This has been deprecated in the new API. formula - Chemical formula to search for. property - Name of the property to search for. contributor - Name of the contributor of the data. This has been deprecated in the new API. reference - Filter against the reference field. This field has been broken into multiple parts. The example below shows how to use the DOI filter. See ReferenceQuery for more options. min_measurement - Minimum value to allow for the property. max_measurement - Maximum value to allow for the property. from_record - Index of the first record to return. per_page - Number of results to return. data_set_id - ID of the dataset to search on. These fields map to a the new PifQuery object in the following way. Any fields that are not defined can be omitted. from citrination-client import * query = PifQuery( from_index=`from_record`, size=`per_page`, system=SystemQuery( chemical_formula=ChemicalFieldOperation( filter=ChemicalFilter(equal=`formula`) ), properties=PropertyQuery( name=FieldOperation( filter=Filter(equal=`property`) ), value=FieldOperation( filter=Filter( min=`min_measurement`, max=`max_measurement` ) ) ), references=ReferenceQuery( doi=FieldOperation( filter=Filter(equal=`reference`) ) ) ), include_datasets=[`data_set_id`] ) With this query, the following command can be used to execute against the Citrination site. See PifSearchResult for the format of the results. from citrination-client import * client = CitrinationClient('YOUR_API_KEY') pifSearchResult = client.search(query)","tags":"","url":"migration\/index.html"},{"title":"quickstart","text":"","tags":"","url":"quickstart\/index.html"}]}